app/views/assignments/_form.html.erb

      <div class="form-inputs">
        <%= f.input :employee_id, collection: Employee.active.alphabetical.to_a, include_blank: true %>
        <%= f.input :store_id, collection: Store.active.alphabetical.to_a, include_blank: true %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."active" = ?  [["active", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."active" = ?  [["active", 1]]