app/views/stores/show.html.erb

<% @manager = Assignment.current.for_store(@store).for_role('manager') %>
<% @employee = Assignment.current.for_store(@store).for_role('employee').paginate(page: params[:page]).per_page(10) %>
---
SELECT COUNT(*) FROM "assignments" WHERE (end_date IS NULL) AND (store_id = 1)
SELECT  "assignments".* FROM "assignments" WHERE (end_date IS NULL) AND (store_id = 1) LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]