app/controllers/assignments_controller.rb

    def index
        @assignments = Assignment.chronological.paginate(:page => params[:page]).per_page(5)
---
SELECT  "assignments".* FROM "assignments" ORDER BY start_date DESC, end_date DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]