app/controllers/assignments_controller.rb

  def create
    @assignment = Assignment.new(assignment_params)
    if @assignment.save
---
INSERT INTO "assignments" ("store_id", "employee_id", "start_date", "pay_grade_id") VALUES (?, ?, ?, ?)  [["store_id", 1], ["employee_id", 1], ["start_date", "2019-04-22"], ["pay_grade_id", 1]]

  def set_assignment
    @assignment = Assignment.find(params[:id])
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]