app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE (role = 'manager') AND "employees"."active" = ? ORDER BY last_name, first_name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    # for phase 3 only
    @active_managers = Employee.managers.active.alphabetical.paginate(page: params[:page]).per_page(10)

SELECT "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ?  [["employee_id", 5]]
---
  def retrieve_employee_assignments
    @current_assignment = @employee.current_assignment
    @previous_assignments = @employee.assignments.to_a - [@current_assignment]