app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."active" = ?  [["active", 1]]
---
    def index
        @employees = Employee.active.alphabetical.paginate(:page => params[:page]).per_page(5)

INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "Ezra"], ["last_name", "Bridger"], ["ssn", "037201234"], ["date_of_birth", "2001-04-02"], ["phone", "4122683259"], ["role", "employee"], ["active", 1]]
---
    def create
        @employee = Employee.new(employee_params)
        if @employee.save

UPDATE "employees" SET "first_name" = ?, "last_name" = ?, "ssn" = ?, "phone" = ?, "date_of_birth" = ? WHERE "employees"."id" = ?  [["first_name", "Mark"], ["last_name", "Heimann"], ["ssn", "037201234"], ["phone", "4122683259"], ["date_of_birth", "1994-04-02"], ["id", 1]]
---
    def update
        if @employee.update(employee_params)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_employee
        @employee= Employee.find(params[:id])