app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."active" = ? ORDER BY last_name, first_name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "employees" WHERE (role = 'employee') AND "employees"."active" = ?  [["active", 1]]
---
    def index
        @employees = Employee.active.alphabetical.paginate(:page => params[:page]).per_page(5)

INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @employee = Employee.new(employee_params)
        if @employee.save

UPDATE "employees" SET "first_name" = ?, "last_name" = ?, "ssn" = ?, "phone" = ?, "date_of_birth" = ? WHERE "employees"."id" = ?
---
    def update
        if @employee.update(employee_params)