app/controllers/stores_controller.rb

SELECT "stores".* FROM "stores" WHERE "stores"."active" = ?  [["active", 1]]
SELECT COUNT(*) FROM "stores"
---
  def index
    # get data on all stores and paginate the output to 5 per page
    @active_stores = Store.active.alphabetical.paginate(page: params[:page]).per_page(5)

INSERT INTO "stores" ("name", "street", "city", "state", "zip", "phone", "active") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "CMU"], ["street", "5000 Forbes Avenue"], ["city", "Pittsburgh"], ["state", "PA"], ["zip", "15213"], ["phone", "4643013523"], ["active", 1]]
---
  def create
    @store = Store.new(store_params)
    if @store.save

UPDATE "stores" SET "name" = ?, "street" = ?, "city" = ?, "zip" = ?, "phone" = ? WHERE "stores"."id" = ?  [["name", "North Hills"], ["street", "Sudberry Dr"], ["city", "Wexford"], ["zip", "15090"], ["phone", "7242682323"], ["id", 1]]
---
  def update
    if @store.update_attributes(store_params)

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_store
    @store = Store.find(params[:id])