app/controllers/stores_controller.rb

SELECT  "stores".* FROM "stores" WHERE "stores"."active" = ? ORDER BY name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "stores" WHERE "stores"."active" = ?  [["active", 1]]
---
  def index
    # get data on all stores and paginate the output to 5 per page
    @active_stores = Store.active.alphabetical.paginate(page: params[:page]).per_page(5)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."store_id" = ? AND (end_date IS NULL)  [["store_id", 1]]
---
  def show
    @current_managers = @store.assignments.current.map{|a| a.employee}.sort_by{|e| e.name}.select{|e| e.role == 'manager'}
    @current_employees = @store.assignments.current.map{|a| a.employee}.sort_by{|e| e.name}

INSERT INTO "stores" ("name", "street", "city", "state", "zip", "phone", "active") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @store = Store.new(store_params)
    if @store.save

UPDATE "stores" SET "name" = ?, "street" = ?, "city" = ?, "zip" = ?, "phone" = ? WHERE "stores"."id" = ?
---
  def update
    if @store.update_attributes(store_params)