app/models/assignment.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "assignments" SET "end_date" = ? WHERE "assignments"."id" = ?  [["end_date", "2019-04-22"], ["id", 8]]
---
  def end_previous_assignment
    current_assignment = Employee.find(self.employee_id).current_assignment
    if current_assignment.nil?
      return true
    else
      current_assignment.update_attribute(:end_date, self.start_date.to_date)

SELECT "employees".* FROM "employees" WHERE "employees"."active" = ?
---
  def employee_is_active_in_system
    all_employee_ids = Employee.active.map(&:id)

SELECT "stores".* FROM "stores" WHERE "stores"."active" = ?
---
  def store_is_active_in_system
    all_store_ids = Store.active.map(&:id)